
def DrawMainMenu():
    menu=["Запустить калькулятор для вещественных чисел","Запустить калькулятор для комплексных чисел","Посмотреть сохраненные логи","Выход из программы"]
    lenght=len(menu)
    print("-----------------------------------------------")
    for i in range(lenght):
        print(f"{i+1}. {menu[i]}")
    print("-----------------------------------------------")
    menuItem=input("Введите пункт меню и нажмите Enter: ")
    return menuItem

def DrawSubMenu():
    menu=["Показать все сохраненные логи","Показать логи за день","Показать логи за месяц","Показать логи за год","Выход в основное меню"]
    lenght=len(menu)
    print("-----------------------------------------------")
    for i in range(lenght):
        print(f"{i+1}. {menu[i]}")
    print("-----------------------------------------------")
    subMenuItem=input("Введите пункт меню и нажмите Enter: ")
    return subMenuItem


